[
    {
        "Title": "Authorities in East Bay seek help after weekend marred by gun violence",
        "Body Text": "There is a growing call for change after a violent weekend in the East Bay, where authorities are investigating shootings in Oakland, Antioch and Bay Point. The three shootings are believed to be unrelated, and authorities from each locale are asking for the public's help in tracking down the shooters.  In West Oakland on Saturday, a 38-year-old man was shot and killed at DeFremery Park as a McClymonds High School reunion picnic was wrapping up at about 7:30 p.m., police said. Oakland police are investigating and urged anyone with information to contact the Homicide Section at 510-238-3821. In Antioch early Sunday morning, a 30-year-old man was shot in the stomach on Huntsman Way and Whitetail Drive, police said. The victim was taken to a hospital, where he was in critical condition. In Bay Point just before 6 p.m. Sunday, two people, including a baby girl, were shot and injured in what witnesses say was a drive-by shooting in the area of Desanie Circle and Laura Ann Court, Contra Costa County sheriff's deputies said.  The victims were taken to a hospital, and their conditions were unknown as of Monday morning. Mayor Sheng Thao and police held a news conference Sunday morning regarding the Oakland shooting. \"I am deeply saddened there was a shooting at the McClymonds Alumni Action Committee reunion picnic at DeFremery Park,\" Thao said. \"We will not tolerate this type of violence, especially at a peaceful annual gathering.\"                                            ",
        "Publication Date": "2024-09-30T12:57:50-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/local/east-bay/authorities-seek-help-gun-violence/3666462/"
    },
    {
        "Title": "1 dead, 12 displaced in San Leandro residential fire",
        "Body Text": "Fire crews are investigating a deadly residential fire in San Leandro on Sunday. According to the Alameda County Fire Department, officials responded near 14400 block of Washington Avenue around 3:23 p.m., where one man and a dog were found deceased due to the fire. The victim was identified by the Alameda County Coroner as 78-year-old Theodis Patterson.  Three individuals were in the home where the fire originated, and two were able to escape. The fire caused damage to four apartments, ultimately displacing 12 people, per the ACFD. The cause of the fire has yet to be confirmed. No other information was made available.                                             ",
        "Publication Date": "2024-09-30T01:20:01-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/local/east-bay/1-dead-in-san-leandro-residential-fire/3666197/"
    },
    {
        "Title": "Man shot in the stomach in Antioch, police say",
        "Body Text": "A 30-year-old man was shot in the stomach in Antioch in the early hours of Sunday, police said. A 30-year-old man was shot in the stomach in Antioch early Sunday morning, police said. The shooting occurred in the 2300 block of Huntsman Way, at Whitetail Drive, according to police.  Officers responded around 4:01 a.m. to a report of a man who had just been shot, police said. The officers found a man in the front yard of a house with a gunshot wound to his stomach, according to police. Firefighters and paramedics rendered aid to the victim and he was taken to the hospital, where he is in critical but stable condition, police said. An investigation of the shooting is underway and witness statements and evidence are being collected, police said.                                            ",
        "Publication Date": "2024-09-29T17:30:55-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/local/overnight-shooting-antioch/3665551/"
    },
    {
        "Title": "Verizon service outage impacts customers across the country",
        "Category": "TECHNOLOGY",
        "Body Text": "A massive cellphone service outage appeared to be impacting customers across the country Monday morning.  Starting around 6:30 a.m., Verizon outage reports began to spike on Downdetector.com. By 9 a.m., more than 100,000 reports had been submitted on the site with the reports coming from across the country, including New York, California and Michigan. Searches related to Verizon on Google also spiked around the same time. Some customers were complaining their phone was going into \"SOS\" mode, which Apple says means your phone is not connected to a cellular network. Verizon released a statement to NBC News: \"We are aware of an issue impacting service for some customers. Our engineers are engaged and we are working quickly to identify and solve the issue.\" We are aware of an issue impacting service for some customers. Our engineers are engaged and we are working quickly to identify and solve the issue. The telecommunications company was responding to users on its support account on X saying, \"We understand the importance of staying connected, and would be happy to take a look at what's occurring. Please send us a DM, and we can jump right in!\" and \"Hello! I know how frustrating this may be and how important it is to have reliable service. Send us a DM to address any concerns you may have today.\" Users also reported issues accessing Verizon's support page on its website. Emergency SOS allows iPhone users to make automatic calls to emergency services and share their location with them when they don't have cellular service. iPhone users can also create emergency contacts that will receive a text message of the user's location after the emergency call ends. Emergency services will receive updates on changes to location for a limited time after the user enters SOS mode. If a user has location services off, it will automatically turn on temporarily. Once location is shared, users will get a reminder to stop sharing their location every four hours for 24 hours. To shut off location sharing, users can tap the status bar and select \"Stop Sharing Emergency Location.\" Users can also text emergency services via satellite on all iPhone 14 or later models when no cellular service or Wi-Fi is available. iPhone 14 or later and Apple Watch also have Crash Detection. For iPhone 8 or later: For iPhone 7 or earlier:                                            ",
        "Publication Date": "2024-09-30T18:14:14-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/verizon-cell-phone-outage/3666743/"
    },
    {
        "Title": "Giants hire Buster Posey as president of baseball ops, replacing Farhan Zaidi",
        "Category": "GIANTS",
        "Body Text": "The San Francisco Giants have hired former catcher Buster Posey as president of baseball operations and fired Farhan Zaidi. Chairman Greg Johnson made the announcement Monday after the Giants finished 80-82 in manager Bob Melvin's first season — with one more victory than in 2023. San Francisco hasn't reached the playoffs since winning the NL West in 2021.  The 37-year-old Posey joined the club's ownership group in September 2022, less than a year after his retirement in November 2021. “As we look ahead, I’m excited to share that Buster Posey will now take on a greater role as the new president of baseball operations,” Johnson said in a statement. “We are looking for someone who can define, direct and lead this franchise’s baseball philosophy and we feel that Buster is the perfect fit. Buster has the demeanor, intelligence and drive to do this job, and we are confident that he and Bob Melvin will work together to bring back winning baseball to San Francisco.”  Posey was a seven-time All-Star with a career .302 batting average. He was San Francisco's fifth overall draft pick in the 2008 amateur draft out of Florida State. He and wife Kristen moved their family back to the East Bay suburb of Lafayette last year after a stint living in their native Georgia immediately following his retirement. He called it a career after the Giants' franchise-record 107-win season in 2021. He opted out of the pandemic-shortened 2020 campaign. Zaidi was hired away from the rival Los Angeles Dodgers in November 2018. “We appreciate Farhan’s commitment to the organization and his passion for making an impact in our community during his six years with the Giants,\" Johnson said. \"Ultimately, the results have not been what we had hoped, and while that responsibility is shared by all of us, we have decided that a change is necessary.” Johnson, Posey and Melvin were set to address the media on Tuesday at Oracle Park. It was unclear which candidates from underrepresented groups were considered by the Giants, as required by Major League Baseball. “We are also fully committed to following the Selig Rule and ensuring diversity in our hiring for any of our open positions,” Johnson said.                                            ",
        "Publication Date": "2024-09-30T17:39:53-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/sports/mlb/san-francisco-giants/farhan-zaidi-buster-posey-president-of-baseball-operations/3666766/"
    },
    {
        "Title": "Authorities in East Bay seek help after weekend marred by gun violence",
        "Category": "EAST BAY",
        "Body Text": "There is a growing call for change after a violent weekend in the East Bay, where authorities are investigating shootings in Oakland, Antioch and Bay Point. The three shootings are believed to be unrelated, and authorities from each locale are asking for the public's help in tracking down the shooters.  In West Oakland on Saturday, a 38-year-old man was shot and killed at DeFremery Park as a McClymonds High School reunion picnic was wrapping up at about 7:30 p.m., police said. Oakland police are investigating and urged anyone with information to contact the Homicide Section at 510-238-3821. In Antioch early Sunday morning, a 30-year-old man was shot in the stomach on Huntsman Way and Whitetail Drive, police said. The victim was taken to a hospital, where he was in critical condition. In Bay Point just before 6 p.m. Sunday, two people, including a baby girl, were shot and injured in what witnesses say was a drive-by shooting in the area of Desanie Circle and Laura Ann Court, Contra Costa County sheriff's deputies said.  The victims were taken to a hospital, and their conditions were unknown as of Monday morning. Mayor Sheng Thao and police held a news conference Sunday morning regarding the Oakland shooting. \"I am deeply saddened there was a shooting at the McClymonds Alumni Action Committee reunion picnic at DeFremery Park,\" Thao said. \"We will not tolerate this type of violence, especially at a peaceful annual gathering.\"                                            ",
        "Publication Date": "2024-09-30T12:57:50-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/local/east-bay/authorities-seek-help-gun-violence/3666462/"
    },
    {
        "Title": "1 dead after crash on Interstate 880 in San Jose",
        "Category": "SAN JOSE",
        "Body Text": "All lanes have reopened along northbound Interstate 880 in San Jose after a fatal crash early Monday, according to the California Highway Patrol. The CHP said that around 4:40 a.m. a car overturned after colliding with the center divider in the freeway's northbound lanes near The Alameda.  Moments later, a motorcycle crashed into the overturned vehicle. Due to the impact, the motorcyclist was ejected and landed in bushes near the freeway. The CHP confirmed that at least one person died in the collision. Northbound lanes of I-880 in the area were blocked by the crash but reopened about 8:30 a.m. No other information about the collision was immediately available.                                            ",
        "Publication Date": "2024-09-30T16:41:40-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/local/south-bay/deadly-crash-interstate-880-san-jose/3666699/"
    },
    {
        "Title": "Parents will have to set aside some earnings for child influencers under new California laws",
        "Category": "CALIFORNIA",
        "Body Text": "Parents in California who profit from social media posts featuring their children will be required to set aside some earnings for their minor influencers under a pair of measures signed Thursday by Gov. Gavin Newsom. California led the nation nearly 80 years ago in setting ground rules to protect child performers from financial abuse, but those regulations needed updating, Newsom said. The existing law covers children working in movies and TV but doesn’t extend to minors making their names on platforms such as TikTok and Instagram.  Family-style vlogs, where influencers share details of their daily lives with countless strangers on the internet, have become a popular and lucrative way to earn money for many. Besides coordinated dances and funny toddler comments, family vlogs nowadays may share intimate details of their children’s lives — grades, potty training, illnesses, misbehaviors, first periods — for strangers to view. Brand deals featuring the internet’s darlings can reap tens of thousands of dollars per video, but there have been minimal regulations for the “sharenthood” industry, which experts say can cause serious harm to children. “A lot has changed since Hollywood’s early days, but here in California, our laser focus on protecting kids from exploitation remains the same,” he said in a statement. \"In old Hollywood, child actors were exploited. In 2024, it’s now child influencers. Today, that modern exploitation ends through two new laws to protect young influencers on TikTok, Instagram, YouTube, and other social media platforms.” The California laws protecting child social media influencers follow the first-in-the-nation legislation in Illinois that took effect this July. The California measures apply to all children under 18, while the Illinois law covers those under 16. The California measures, which received overwhelming bipartisan support, require parents and guardians who monetize their children’s online presence to establish a trust for the starlets. Parents will have to keep records of how many minutes the children appear in their online content and how much money they earn from those posts, among other things.  The laws entitle child influencers to a percentage of earnings based on how often they appear on video blogs or online content that generates at least 10 cents per view. The children could sue their parents for failing to do so. Children employed as content creators on platforms such as YouTube will also have at least 15% of their earnings deposited in a trust for when they turn 18. An existing state law has provided such protection to child actors since 1939 after a silent film-era child actor Jackie Coogan sued his parents for squandering his earnings. The new laws will take effect next year. The laws have the support from The Screen Actors Guild-American Federation of Television and Radio Artists, or, SAG-AFTRA, and singer Demi Lovato, a former child star who has spoken publicly about child performers abuse. “In order to build a better future for the next generation of child stars, we need to put protections in place for minors working in the digital space,” Lovato said in a statement. \"I’m grateful to Governor Newsom for taking action with this update to the Coogan Law that will ensure children featured on social media are granted agency when they come of age and are properly compensated for the use of their name and likeness.” The new laws protecting child influencers are part of ongoing efforts by Newsom to address the mental health impacts of social media on children. Newsom earlier this month also signed a bill to curb student phone access at schools and ban social media platforms from knowingly providing addictive feeds to children without parental consent.                                            ",
        "Publication Date": "2024-09-26T19:02:10-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/california/child-influencer-earnings-new-laws/3663211/"
    },
    {
        "Title": "PG&E power shutoffs planned in North Bay, Northern California",
        "Category": "PG&E",
        "Body Text": "PG&E on Monday is planning to shut off power to dozens of customers in Napa County as part of its Public Safety Power Shutoffs program, according to the Napa County Sheriff's Office. The utility will shut off power to 143 customers in northwest Napa County, north of Tubbs Road, starting at 6 p.m. Monday and it will remain out until 7 a.m. Tuesday, the sheriff's office said on social media.  A community resource center will be open for Napa County residents at 1307 Washington St. in Calistoga from 8 a.m. to 10 p.m. Monday. PG&E told NBC Bay Area it had not yet confirmed the Napa County shutoff detailed by the sheriff's office, saying it had not made that decision. In the Bay Area on Saturday, notices of possible PSPS outages were sent to 57 customers in Alameda County, 286 in Contra Costa County, 140 in Napa County and 11 in Sonoma County, PG&E said. Planned PSPS outages are subject to change depending on timing and shifts in the weather, PG&E said.  The utility early Monday did begin PSPS outages affecting hundreds of customers in Butte and Shasta counties as planned, PG&E said. For more information and the latest updates on PSPS outages, visit PG&E's website.                                            ",
        "Publication Date": "2024-09-30T17:21:48-07:00",
        "Source Domain": "www.nbcbayarea.com",
        "URL": "https://www.nbcbayarea.com/news/local/north-bay/pge-power-shutoffs-planned-in-north-bay-northern-california/3666736/"
    }
]